BaseConfiguration/Money_2_0/InformationRegisters/КонтрольПроцессовОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтрольПроцессовОбменаДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияАвтономныхКопий</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.МобильноеПриложение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПроцессыОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/КонтрольПроцессовОбменаДанными/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//

#Область ПрограммныйИнтерфейс

Функция ЗаписьУзлаДляПроцесса(Узел, знач Процесс) Экспорт
	
	Если ТипЗнч(Процесс) = Тип("Строка") Тогда
		Процесс = Перечисления.ПроцессыОбменаДанными[Процесс];
	КонецЕсли;
	
	Запись = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьМенеджерЗаписи();
	Запись.Узел = Узел;
	Запись.Процесс = Процесс;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Запись.Узел = Узел;
		Запись.Процесс = Процесс;
		Запись.Записать();
	КонецЕсли;
	
	Возврат Запись;
	
КонецФункции

Функция ДоступноДляБлокировки(Узел, знач Процесс) Экспорт
	
	Если ТипЗнч(Процесс) = Тип("Строка") Тогда
		Процесс = Перечисления.ПроцессыОбменаДанными[Процесс];
	КонецЕсли;

	Запись = ЗаписьУзлаДляПроцесса(Узел, Процесс);
	Если Не Запись.Выбран() Тогда
		ВызватьИсключение СтрШаблон( НСтр("ru='Невозможно проверить процесс обмена ""%1"" для узла ""%2"": отсутствует запись регистра сведений'"), 
				Процесс, Узел);
	КонецЕсли;
	
	Ключ = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьКлючЗаписи(Новый Структура("Узел, Процесс", Узел, Процесс));
	Результат = Ложь;
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ключ);
		Результат = Истина;
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	РазблокироватьДанныеДляРедактирования(Ключ);
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти

//
#КонецЕсли
